In [1]:
import pandas as pd

In [13]:
names=["tanzima","pushpa"]
marks=[21,45]
names

['tanzima', 'pushpa']

In [14]:
marks

[21, 45]

In [6]:
df=pd.Series(data=marks)
df

0    21
1    45
dtype: int64

In [7]:
type(df)

pandas.core.series.Series

In [9]:
nd=pd.Series(data=names)
nd

0    tanzima
1     pushpa
dtype: object

In [10]:
type(nd)

pandas.core.series.Series

In [27]:
student={"Name":names,"Marks":marks}
student

{'Marks': [21, 45], 'Name': ['tanzima', 'pushpa']}

In [21]:
dt=pd.DataFrame(data=student,index=['A','B'])
dt

   Mark     Name
A    21  tanzima
B    45   pushpa

In [22]:
dt.shape

(2, 2)

In [23]:
dt.info

<bound method DataFrame.info of    Mark     Name
A    21  tanzima
B    45   pushpa>

In [28]:
dt.describe

<bound method NDFrame.describe of    Mark     Name
A    21  tanzima
B    45   pushpa>

In [29]:
dt.head(1)

   Mark     Name
A    21  tanzima

In [31]:
dt.tail(1)

   Mark    Name
B    45  pushpa

In [33]:
name=["tanzima","pushpa","Asad","Kajal"]
mark=[21,45,56,78]
name

['tanzima', 'pushpa', 'Asad', 'Kajal']

In [34]:
mark

[21, 45, 56, 78]

In [20]:
import pandas as pd
dt=pd.read_csv('student.csv')
dt

       Name  Age  Marks
0      Asad   23     90
1   Tanzima   22     80
2    Pushpa   21     90
3     Mansi   23     90
4       Raj   24     67
5    Prerna   25     90
6     kajal   23     59
7     Jigar   22     97
8    Krisha   21     87
9     Kajal   24     86
10    Payal   21     34
11     Maya   23     43
12   Nikunj   21     44
13  Dhrumit   20     55
14    Hiral   21     67
15      Ami   22     78
16   Hardik   21     87
17   Sachin   21     88
18   Antima   22     89

In [15]:
dt.shape

(19, 3)

In [16]:
dt.size

57

In [17]:
dt.head(5)

      Name  Age  Marks
0     Asad   23     90
1  Tanzima   22     80
2   Pushpa   21     90
3    Mansi   23     90
4      Raj   24     67

In [18]:
dt.tail(5)

      Name  Age  Marks
14   Hiral   21     67
15     Ami   22     78
16  Hardik   21     87
17  Sachin   21     88
18  Antima   22     89

In [22]:
type(dt)

pandas.core.frame.DataFrame

In [23]:
dt.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [27]:
print(dt.iloc[10])

Name     Payal
Age         21
Marks       34
Name: 10, dtype: object

In [28]:
dt["Name"]

0        Asad
1     Tanzima
2      Pushpa
3       Mansi
4         Raj
5      Prerna
6       kajal
7       Jigar
8      Krisha
9       Kajal
10      Payal
11       Maya
12     Nikunj
13    Dhrumit
14      Hiral
15        Ami
16     Hardik
17     Sachin
18     Antima
Name: Name, dtype: object

In [35]:
dt[['Name','Age']]

       Name  Age
0      Asad   23
1   Tanzima   22
2    Pushpa   21
3     Mansi   23
4       Raj   24
5    Prerna   25
6     kajal   23
7     Jigar   22
8    Krisha   21
9     Kajal   24
10    Payal   21
11     Maya   23
12   Nikunj   21
13  Dhrumit   20
14    Hiral   21
15      Ami   22
16   Hardik   21
17   Sachin   21
18   Antima   22

In [31]:
#index location
print(dt.iloc[12:18])

       Name  Age  Marks
12   Nikunj   21     44
13  Dhrumit   20     55
14    Hiral   21     67
15      Ami   22     78
16   Hardik   21     87
17   Sachin   21     88

In [32]:
dt.head(3)

      Name  Age  Marks
0     Asad   23     90
1  Tanzima   22     80
2   Pushpa   21     90

In [33]:
dt.tail(3)

      Name  Age  Marks
16  Hardik   21     87
17  Sachin   21     88
18  Antima   22     89

In [38]:
dt['mark2']=[45,50,12,14,17,19,20,20,20,13,16,17,19,21,23,44,55,66,55]
dt

       Name  Age  Marks  mark2
0      Asad   23     90     45
1   Tanzima   22     80     50
2    Pushpa   21     90     12
3     Mansi   23     90     14
4       Raj   24     67     17
5    Prerna   25     90     19
6     kajal   23     59     20
7     Jigar   22     97     20
8    Krisha   21     87     20
9     Kajal   24     86     13
10    Payal   21     34     16
11     Maya   23     43     17
12   Nikunj   21     44     19
13  Dhrumit   20     55     21
14    Hiral   21     67     23
15      Ami   22     78     44
16   Hardik   21     87     55
17   Sachin   21     88     66
18   Antima   22     89     55

In [39]:
dt['Total']=dt['Marks']+dt['mark2']
dt

       Name  Age  Marks  mark2  Total
0      Asad   23     90     45    135
1   Tanzima   22     80     50    130
2    Pushpa   21     90     12    102
3     Mansi   23     90     14    104
4       Raj   24     67     17     84
5    Prerna   25     90     19    109
6     kajal   23     59     20     79
7     Jigar   22     97     20    117
8    Krisha   21     87     20    107
9     Kajal   24     86     13     99
10    Payal   21     34     16     50
11     Maya   23     43     17     60
12   Nikunj   21     44     19     63
13  Dhrumit   20     55     21     76
14    Hiral   21     67     23     90
15      Ami   22     78     44    122
16   Hardik   21     87     55    142
17   Sachin   21     88     66    154
18   Antima   22     89     55    144

In [40]:
df=dt.rename(columns={'Marks':'Java','mark2':'Python'})
df

       Name  Age  Java  Python  Total
0      Asad   23    90      45    135
1   Tanzima   22    80      50    130
2    Pushpa   21    90      12    102
3     Mansi   23    90      14    104
4       Raj   24    67      17     84
5    Prerna   25    90      19    109
6     kajal   23    59      20     79
7     Jigar   22    97      20    117
8    Krisha   21    87      20    107
9     Kajal   24    86      13     99
10    Payal   21    34      16     50
11     Maya   23    43      17     60
12   Nikunj   21    44      19     63
13  Dhrumit   20    55      21     76
14    Hiral   21    67      23     90
15      Ami   22    78      44    122
16   Hardik   21    87      55    142
17   Sachin   21    88      66    154
18   Antima   22    89      55    144